</s>
<unk>
the
of
and
a
to
in
his
he
I
with
that
was
on
for
it
her
you
is
at
by
him
as
The
all
from
or
He
be
she
they
had
out
not
my
Mr
their
up
like
me
have
an
A
And
one
them
about
when
said.
were
are
what
which
your
says
so
if
Bloom
there
but
said
old
over
this
down
no
would
then
after
who
into
Stephen
What
did
two
its
do
off
will
those
some
see
could
we
BLOOM:
man
other
said,
little
has
She
back
too
His
more
it.
our
You
time
through
know
good
get
THE
But
eyes
round
They
only
now
under
long
any
(He
where
never
It
put
way
very
hand
In
been
us
him.
just
came
can
go
before
first
John
went
going
J.
made
than
because
That
All
being
thing
young
Mrs
make
come
always
must
face
himself
me.
say
last
got
night
name
day
ever
might
head
much
left
street
without
took
saw
poor
told
let
something
him,
white
Then
right
—I
new
though
am
how
well
O
and,
upon
I’m
same
don’t
own
most
tell
till
Father
To
woman
again
against
look
want
every
between
give
God
bit
such
turned
towards
course
gave
O,
take
it,
S.
Dedalus
away
Mulligan
here
you.
hat
We
too.
My
that.
black
behind
voice
How
three
For
heard
If
years
even
think
house
having
now.
Buck
still
bloody
you,
I’ll
while
Not
great
half
along
life
hands
No
—The
Irish
looked
fellow
door
big
men
them.
read
thought
near
place
love
With
knew
yes
dark
looking
high
her.
kind
hear
coming
call
world
wife
these
So
things
father
STEPHEN:
once
Martin
asked
stood
On
full
sir.
home
me,
passed
Miss
up.
another
There
side
each
should
Who
both
feel
far
does
Why
Her
there.
brought
suppose
Bloom,
Project
light
past
water
asked.
red
time.
best
open
By
is.
used
called
word
mouth
better
One
it?
hair
He’s
Yes,
Where
Dublin
That’s
anything
few
it’s
ZOE:
work
may
walked
women
dead
lost
As
that,
heart
Must
mother
de
many
he,
on.
It’s
second
here.
Joe.
—And
quite
sure
morning
why
At
find
Henry
Lenehan
set
—Yes,
Do
seen
Cunningham
money
out.
case
son
blue
street.
eye
bad
Stephen’s
Or
five
street,
feet
gentleman
Conmee
didn’t
words
From
professor
I.
(She
all.
shall
Bloom.
four
This
held
gold
you?
An
also
letter
see.
Lord
corner
knows
next
bed
land
green
nothing
there,
keep
Like
that’s
lord
getting
lovely
air
No,
foot
paper
Bloom’s
sweet
grey
her,
again.
Let
found
among
Ill
lay
felt
Is
wanted
times
nor
back.
myself
them,
point
done
end
often
book
man,
life.
Did
nice
(The
hes
Gutenberg-tm
1
eyes.
across
turn
ought
believe
around
matter
human
he’s
whole
Leopold
comes
sea
cold
large
year
fine
taking
Good
girl
When
man.
arms
right.
in.
ten
hand.
talking
one,
days
dear
hard
Just
Power
he.
(In
laid
Stephen,
that?
Of
Im
Haines
brown
lips
wouldn’t
Old
met
Our
fair
There’s
moment
—What
forth
rather
write
enough
number
part
Cissy
show
yet
simply
sun
Ireland
free
Still
on,
Ben
run
certain
(With
Come
body
followed
form
soft
gone
people
wonder
Ned
miss
forward
pocket
window
sir
—O,
waiting
C.
After
mind
public
Gerty
Two
you’re
face.
fingers
cut
walking
Now
2
married
P.
per
thou
Master
Tap.
Because
can’t
remember
making
bright
sir,
since
Three
trying
born
M.
rest
sitting
doing
telling
hope
different
use
—You
rose
boy
thy
live
say.
too,
all,
slowly
drew
passing
fat
lady
Molly
began
within
beside
pair
makes
bring
whose
way.
Give
warm
one.
whom
country
to.
walk
holy
hour
sent
world.
Have
was.
Poor
small
account
hed
yellow
soul
blood
eyes,
cried
know,
—A
nose
heavy
given
ask
room
Deasy
day.
No.
natural
Lambert
Wonder
music
lot
citizen.
up,
God,
won’t
others
again,
Don’t
evening
night.
day,
fell
figure
above
blind
true
themselves
person
MRS
WATCH:
Id
sat
death
wants
nature
moved
table
drink
tea
now,
boots
know.
try
perhaps
dog
then.
Boylan
works
BELLO:
didnt
wouldnt
OF
Your
—He
chap
wind
running
couldn’t
change
smell
silk
short
pass
meet
Tom
goes
thats
art
breath
holding
—That
wrong
mean
thinking
down.
Are
pay
Well,
raised
Saint
standing
least
children
child
Dignam
various
O’Molloy
Joe
theyre
off.
hold
hot
sort
away.
Yes.
Their
help
See
late
friend
taken
us.
present
(A
Dedalus,
bent
ancient
calls
Ah,
play
care
paid
whether
milk
man’s
takes
line
church
order
law
beyond
Better
business
kiss
Best
Never
William
car
horse
Myles
Tommy
during
Edy
PRIVATE
silver
sing
leave
then,
fresh
turning
sleep
forget
lifted
wrote
Look
la
none
house.
age
herself
Blazes
reverend
Crawford
female
Alf.
terms
mirror
slow
middle
glass
smiled
speak
rich
silent
out,
saying
idea
wait
tongue
city
amid
someone
Was
back,
priest
died
beautiful
yes.
Only
six
Paddy
hundred
What?
whatever
A.
husband
Douce
dont
himself.
Tell
together
say,
language
possible
itself
written
hand,
O.
ago
bread
is,
inside
skirt
outside
Corny
really
fact
shillings
Joe,
LYNCH:
James
air.
top
instant
real
was,
damn
arm
touch
quickly
over.
sang
twice
quick
French
spoke
today.
first.
quiet
deep
May
ran
Pat
watch
name.
double
wall
reading
pretty
Nosey
Eglinton
begat
loose
gaze
halted
kitchen
in,
morning.
clean
B.
general
Bob
earth
Richie
private
Got
low
throw
more.
liked
summer
eye.
act
ear
5
Jack
usual
which,
Dollard
Flynn
sailor
(To
smile
finger
laughing
Will
said:
me?
suddenly
flesh
money.
—Well,
hell
dress
What’s
eat
card
handed
wild
answer
loved
Too
buy
yes,
fire
Get
front
bar
office
reason
catch
job
Milly
daughter
royal
M’Coy
Cowley
right,
seemed
hate
several
couldnt
electronic
blessed
head.
teeth
strong
dying
giving
wish
points
woman’s
Mary
watched
—Is
—No,
else
hands.
door.
neck
save
fall
bridge
ball
led
cry
devil
thousand
male
known
stuck
Might
piece
cup
means
Kelleher
family
company
talk
everything
Dr
square
carriage
worth
holds
stands
bronze
theres
almost
bearing
broke
crossed
stone
singing
time,
there’s
—That’s
common
putting
no,
happy
laugh
court
opened
shadow
road
sometimes
do.
easy
letters
following
false
soon
Wait.
living
Those
cool
King
king
received
looks
She’s
he?
Kernan
opposite
question
George
bottom
rev.
Caffrey
moment.
ring
be.
laughed
trousers
dead.
alone
secret
words.
meeting
sir?
woman,
God’s
seven
bore
rock
cried.
threw
Had
page
Moses
sit
saint
beauty
somewhere
wide
steps
W.
hat.
Hamlet
leg
Simon
played
cap
—What’s
well,
scene
return
what’s
sad
editor
(a
citizen,
less
gazed
pray
wear
seeing
fear
are.
face,
tall
showing
to,
More
Wait
nine
clothes
wearing
lie
heads
today
father,
gives
You’re
Spanish
Something
flower
perhaps.
rolled
L.
First
Great
wasn’t
life,
he’d
so,
Davy
asking
D.
fellows
(His
citizen
birth
FLORRY:
BELLA:
£
answered
lips.
sea.
answered.
now?
shook
house,
—We
thick
do,
drank
understand
smiling
sense
word.
course,
brother
eh?
dressed
head,
death.
touched
have.
so.
seated
lower
wet
drove
mine
High
either
North
Nice
mouth.
hall
hanging
place.
tiny
falling
skin
way,
hotel
Well
H.
E.
—Ay,
ladies
bought
Michael
Gob,
starts
Gutenberg
ad
sight
Mulligan,
—How
thinks
Out
—But
folded
doesn’t
Peter
memory
pity
Where’s
grave
grand
third
Time
easily
pocket.
Roman
here,
Some
stick
Can
coat
printed
not?
3
host
what?
about.
men.
gone.
simple
Red
rising
cat
Be
die
close
especially
story
girls
him!
picture
possibly
afraid
places
tried
fool
turns
Little
Hynes
T.
other,
Holles
(the
FIRST
Last
gay
aunt
dirty
loud
shirt
beneath
water.
—I’m
bed.
words,
staring
feeling
wait.
et
medical
Would
Thomas
him?
Go
closed
lived
Shakespeare
nothing.
prince
Ten
learn
once.
Has
master
awfully
famous
wore
Who’s
lane
sign
glance
flowers
4
gentle
glanced
paper.
Keep
playing
pleasure
bottle
friends
song
hair.
particular
Also
Patrick
penny
gets
Big
chief
greatest
Love
attention
kissed
Kennedy
cause
Boardman
Lynch
containing
cant
English
hair,
trouble
showed
down,
heart.
breast
school
us,
lines
pages
woman.
national
think.
father’s
wine
stopped
week
hear.
manner
lies
—Who
away,
struck
eleven
Dublin.
boys
days.
Here.
drawn
Most
Take
kick
forgot
Want
pure
cross
pound
need
of.
month
home.
won
perfume
placed
imagine
power
suit
shape
coffin
belly
somebody
moon
O’Madden
Wyse
marked
due
F.
Dilly
highly
baby
CARR:
BREEN:
wasnt
[
]
plump
—Come
sideways
legs
twenty
aside
upper
colour
killed
farther
dull
—It
spirit
worse
voice,
mother’s
—Are
flung
carried
inner
Very
hat,
father.
tired
sides
Jesus,
mean,
offered
odd
bob
shot
—There
faces
youth
waters
be,
see,
bell
strange
kept
queer
son.
queen
bank
bare
Royal
note
sun.
caught
fish
after.
meat
Always
Marion
I’d
writing
pounds
months
hole
certainly
follow
straw
boy.
anyhow
MacHugh
cast
scarlet
perfect
neither
unless
distant
poetry
rain
loves
Messrs
meant
appears
twins
hand.)
Bloom.)
VIRAG:
anyone
covered
name,
stepped
watching
Were
mass
night,
other.
dancing
except
—Do
eating
sound
go.
hadn’t
collar
table.
ghost
beginning
image
empty
Joseph
cannot
plain
seems
British
proud
Here
I,
heaven
race
earth,
study
step
carry
already
—Good
Ireland,
love.
pink
thing.
tear
ate
Say
Every
earth.
windows
straight
named
noticed
hours
Could
row
handsome
honourable
Which
Suppose
wife.
no-one
railway
hats
she’s
legal
party
luck
tomorrow
letting
tight
pick
leaving
United
stop
engaged
Burke
future
noble
O!
sister
sick
Dublin,
concerning
Kitty
fashion
(Her
shes
gently
air,
this,
pleasant
Malachi
saved
pull
bay
voice.
—They
you!
—It’s
voices
asked,
hung
soul.
shining
floor
pulled
But,
sudden
Here,
send
poured
entered
stretched
Yet
changed
truth
do?
huge
sacred
bringing
mad
brief
personal
Make
mind.
stars
knock
sharp
you’ll
stared
horses
papers
space
ends
moving
Blessed
including
sand
not.
somewhere.
brass
broken
Green
shut
Can’t
buried
flat
ground
glad
dry
breakfast
no.
anyhow.
Black
smoking
funeral
town
open.
bear
Italian
concert
himself,
address
Lyons
so?
please
notice
dinner
tribe
special
handkerchief
Lenehan,
drinking
shoes
parts
proper
10
indeed
remembered
Charles
guest
lamp
vast
consequence
tree
Jacky
besides
however,
(Bloom
copy
taste
it:
lightly
love,
death,
odour
You’ll
end.
another.
me!
Why?
happened
spoken
heart,
slowly,
filled
morning,
drunk
merry
doorway
candle
lifting
God.
—He’s
more,
first,
wash
stiff
gloves
picked
state
equal
becomes
fly
hands,
stand
example
water,
glasses
weak
fancy
field
moustache
bound
king’s
Even
influence
pace
work.
Perhaps
City
Thank
drunken
forward,
widow
La
Gold
this.
ears
well.
Under
speech
draws
While
butter
crown
early
by.
New
subject
sending
before.
cream
animal
Philip
dance
quay
road.
Women
Bantam
—I’ll
naughty
Same
rolling
come.
evidence
fifty
interesting
Holy
interest
statue
Foundation
mercy
not,
sold
habit
golden
AND
match
Lady
mention
Trinity
access
smart
Breen
U.
Alf
Byrne
Don
thee
lifts
according
did.
stage
(in
Gibraltar
pretending
existence
SECOND
NYMPH:
pale
added
isn’t
Kinch,
pockets
mother.
circle
table,
tea,
answered,
—Did
girl.
forgotten
damned
she.
reached
names
Ireland.
tender
speaking
ashplant
mourning
Harry
thumb
side.
tide
bag
bridge.
cries
own.
bends
sheet
something.
slightly
I?
broad
ways
fight
shoulders
naked
better.
yourself
friend.
name?
bits
see?
corner.
castle
answer.
bones
waves
rapidly
for,
moon.
violet
lives
curse
men,
still.
likes
course.
property
slip
county
draw
heels
piano
Ah!
office.
grace
waistcoat
—Hello,
yet.
London
flying
Long
train
Denis
he’ll
started
beard
fast
J
burst
houses
Mount
touching
properly
object
below
bosom
mountain
Lenehan.
Ned.
chance
trees
had.
poet
drawing
Mina
mixed
minutes
June
look,
reflection
original
however
capital
removed
mutual
Rudolph
tears
rendered
wont
fee
him.)
KITTY:
Though
throat
leaned
please.
pointed
edge
fit
noise
softly
tower
alone.
calling
same.
saying:
Quite
cheap
oil
library
Stephen.
problem
Damn
quarter
waited
dark.
mine.
salt
chest
window.
final
book.
books
striking
scarcely
bow
purple
shillings.
pointing
Down
chair
darling
jew
Looking
wise
leaves
Greek
uncle
bald
nose.
lift
Howth
tram
bowed
Remember
murder
Other
south
wife,
smoke
Know
clear
flow
Before
tail
pin
rocks
Hold
souls
wears
eggs
stuff
will,
Agendath
breaking
drawers
photo
Still,
lying
prize
drop
soldiers
probably.
keeping
fellow.
newspaper
lent
feed
sorry
Bad
instead
behind.
Bernard
show.
mental
Goulding
Ward
laughing.
nearly
view
anybody
quid
Up
gentleman,
rose.
Professor
who,
C
appeared
listening
promised
similar
effect
Round
spring
presence
probably
fun
knife
van
South
9
hath
charge
saluted
Ormond
nought
Pat,
seat
evidently
K.
nobody
produced
nation
period
20
keeper
Literary
Archive
stairs
—For
music,
quietly
Mulligan’s
knelt
palm
dream
teeth.
thrust
tin
arm.
Young
—What?
Where?
feet.
two.
music.
prayed
cried,
—In
Five
myself.
visit
washing
creature
tone
—There’s
shade
sea,
rise
lit
yourself.
jews
blowing
bleeding
Another
hill
Any
breath.
learned
—Where
opening
silence
sin
bells
laughter
twelve
sovereign
lump
lose
break
will.
O’Connell
literary
men’s
bull
she?
bite
post
porter
wall.
fellow,
bath
taught
floor.
Sir
listen
Monday
arms,
dark,
Nothing
land,
instance
value
Dignam,
year.
knee
Sweet
raising
Wouldn’t
press
paper,
Hope
six.
second.
slight
Conroy
possessed
eyed
Heigho!
spot
later
picking
job.
puts
man!
Near
Sunday
god
receive
Christ
Christ,
regular
—O
Doctor
soap
gate
weather
Kildare
Goulding,
Simon,
Queen’s
fact.
service
christian
position
Dignam.
brother.
Cork
Both
lights
Eh?
Lombard
Mary,
accompanied
marriage
everyone
cigarette
latter
viceregal
altogether
with.
exactly
suggested
aid
thoughts
heat
quaker
Venus
blond
whore
leading
mentioned
character
R.
charming
hee
knowing
amount
particularly
previously
occasion
result
scheme
Virag
gift
intelligence
anyway
individual
15
CISSY
CAFFREY:
COMPTON:
head.)
Stephen.)
CORNY
KELLEHER:
work,
copyright
anywhere
bowl
peered
gravely
cheeks
stay
search
look.
mighty
brow
liver
General
crooked
his.
harm
doctor
cloud
shake
Four
smelling
sighed
Lord,
Paris
bread,
wind.
form.
glancing
world,
somewhat
rotten
silence.
thank
shilling
two,
coin
blow
character.
limp
suppose.
iron
dare
jew,
sprang
rare
church,
blank
there?
elderly
ear.
shoulder
tale
delicate
Through
slid
sky
ink
—Mr
hid
done.
moment,
leather
years.
light,
fingers.
Parnell
sheets
Arms
Evening
honour
Sandymount
brings
Dan
years,
win
About
order,
eight
Europe
slender
by,
coffee
faith.
strand
point,
lives.
ears.
dropping
Come.
him:
veil
Full
Dead
high.
kidney
grow
they’d
National
does.
shop
purchase
government
street:
race.
Eccles
four.
garden.
Boylan,
lips,
stale
mark
jarvey
girls,
move
ladies’
bit.
tooraloom
weight
college
song.
Didn’t
inclined
meaning
joy
asleep
otherwise
the.
understood
remained
light.
Feel
creaking
—Who?
Bloom?
awful
corporation
Brian
them?
neck,
Menton
left.
whenever
others.
traveller
whoever
clock
Heart
appear
umbrella
one!
features
justice
pulling
I’ve
p:
nurse
carrying
hang
built
Howard
curves
blouse
Rochford
potato
bed,
commercial
articles
hide
laws
(for
merely
glory
star
observed
Nolan
angle
strength
presented
Lidwell
Poldy
fault
paying
sons
wellknown
foreign
colours
former
purpose
ye
crowd
(From
Zoe
Poulaphouca
paragraph
donations
David
Then,
shaking
neck.
shoulder.
Isn’t
elbow
faint
—Ah,
flash
sunlight
say?
seem
die.
else.
mute
gaping
then?
grew
locked
nearer
glorious
boat
forward.
tossed
teapot
this?
sugar
tea.
slice
book,
brother,
—To
times.
wandering
food
washed
Hamlet,
preceding
bending
base
firm
Dick
leaping
—You’re
shell
history
stars.
body,
God!
—Yes.
Half
boy’s
ruin
date
laughed.
No-one
fallen
Talbot
Him
sticks
caps
sum
thanks
Put
things.
question.
beat
signs
off,
shoulders.
war
shore
knocking
deeply
Jesus
choir
like.
rises
white.
people.
Richard
board
walks
Try
I...
rag
body.
dogs
bat
park
grief
lonely
Sad
burning
friend,
up?
stupid
really.
sank
leaning
Off
split
rest.
same,
slim
runs
seaside
mouth,
time?
believe,
box
fond
much.
worse.
says.
weeks
coming.
yesterday
Life
together.
bazaar
forehead
Westland
garden
Flower
sure,
Friday
action
corner,
alone,
Molly.
further
Such
million
millions
together,
bet
stopped.
nine.
College
Captain
shift
lane.
Leonard
People
beauty,
Man
river
child.
thing,
added.
terrible
women.
raw
stained
walk.
rank
Once
Wisdom
keys
ones
themselves.
land.
blew
excuse
blade
Robert
Alexander
pen
ear,
licensed
everybody
hit
wind,
served
strode
swift
soup
postcard
finished
but,
addressed
throwing
bill
We’re
delivery
born.
kinds
nun
fixed
questions
cheers
events
total
priests
were,
hast
cases
sticking
librarian
stranger
form,
possibility
constant
forty
wished
necessary
conscious
sorrow
purse
immediate
area
Hugh
members
Barney
pa
proceeded
Yorkshire
bloom
Hee
hee.
opinion
gentlemen
domestic
start
modern
desire
phenomenon
favourite
possession
musical
(and
agree
dozen
fact,
lighted
surface
petticoat
shed
supposed
hurt
Costello
narrator
nocturnal
couple
(They
Private
seizes
Florry
Bella
16
associated
complete
proved
reduced
doesnt